# Docker-команда FROM вказує базовий образ контейнера
# Наш базовий образ - це Linux з попередньо встановленим python-3.10
FROM python:3.12

# Встановимо змінну середовища
ENV APP_HOME /ParkVision

# Встановимо робочу директорію усередині контейнера
WORKDIR $APP_HOME

# Копіюємо всі інші файли проекту у контейнер
COPY . .

# Встановимо залежності усередині контейнера
RUN pip install -r requirements.txt

# Позначимо порт, на якому працює програма всередині контейнера
EXPOSE 8000

# Запускаємо нашу програму всередині контейнера
CMD ["python", "parking/manage.py", "runserver", "0.0.0.0:8000"]